roam/20210414192358-problems_algorithms.org
#+title: Problems & Algorithms

* Problemi e Algoritmi
** Problemi Computazionali
Collezione di domande (istanze-ingressi) per cui sia stabilito un criterio astratto per riconoscere le risposte (uscite) corrette
- Es
  - Massimo comune divisore
  - moltiplicazione fra due interi
  - fattorizzazione
  - ordinamento
  - percorso ottimo in un grafo

Un Problema é una _Relazione Binaria_
$R = {(istanza,risposta) : istanza, risposta soddisfano...}$
Il _dominio_ della relazione é l'insieme delle domande possibili
R é _univoca_ se ogni istanza ammette una sola risposta

** Algoritmi
Metodo meccanico per risolvere un Problema Computazionale
- Procedura
  + produce un output da qualsiasi input
- Algoritmo
  + procedura che termina per ogni ingressa ammissibile

Un algoritmo é detto deterministico se sullo stesso input fornisce sempre lo stesso output
- ad ogni algoritmo deterministico possiamo associare una finzione input-output

Un algoritmo risolve R, ossia é corretto rispetto ad R, se la sua funzione A associa una risposta ad ogni istanza di R

Un programma implementa piú algoritmi, inoltre implementa opportune strutture dati

*** Peak Finding
Input: vettore A[0...n-1] interi positivi
Output: un intero 0<= p <n t.c. A[p-1]<=A[p]>=A[p+1] dove A[-1]=A[n]=-inf

#+begin_example
Peak(A)
for(i=0;i<length(A);i++)
    if(A[i]>=A[i-1] && A[i]>=A[i+1])
        return i
end for
#+end_example

**** Left Peak Finding
Nel caso migliore =p=0= é un picco
Nel caso peggiore =p=n-1= confronti
**** Max Peak Finding
#+begin_example
MAX-PEAK(A)
r = 0
i = 1
while(i<n-1)
    if A[i] > A[r]
        r <- i
    i <- i+1
end while
return r
#+end_example

Fa sempre lo stesso numero di confronti, sempre =n-1=

**** Analisi
Teorema picco
Si trovano segmenti sempre piú corti su cui vale il teorema a partire da un =q= centrale.

**** Divide et Impera
#+begin_example
PEAK-DI(A,i,j)
p<-(i+j)/2
if A[p-1]<=A[p]>=A[p+1] then
    return p
else
    if A[p-1]>A[p] then
        return PEAK-DI(A,i,p-1)
    else
        return PEAK-DI(A,p+1,j)
    endif
endif

PEAK-FIND-DI(A,n)
return PEAK-DI(A,0,n-1)
#+end_example

$T(n)=\begin{cases} 1 & n=1 \\ T(\frac{n}{2})+1 & n>1 \end{cases}$
$T(n)=T(\frac{n}{2^k})+k$ per $1\le k \le \log_{2}n$
$T(n)=1+\log_{2}n$
** Insolubilitá e Intrattabilitá
- non tutti i problemi hanno una soluzione algoritmica (problema della =terminazione=)
- =intrattabile= é un problema che ha una soluzione algoritmica ma il cui sforzo computazionale é troppo grande

** Correttezza
~Totale~ e ~Parziale~

Specifica
- Precondizioni
- Postcondizioni
  - criterio che stabilisce come deve essere fatto l'output
*** Ricorsione
Un problema si presta alla ricorsione quando la soluzione con un certo input ha una _relazione semplice_ con la soluzione del problema con uno o piú input diminuiti
#+begin_example
HANOI(n,sorgente,destinazione,appoggio)
PRE:
- n>0
- base degli n dischi in alto ha diametro piú piccolo del disco piú in alto sia di destinazione che di appoggio
POST:
- torre di n dischi piú in alto su sorgente é spostata su destinazione

if n-1 then
    sposta un disco da sorgente a destinazione
else
    HANOI(n-1, sorgente, appoggio, destinazione)
    sposta un disco da sorgente a destinazione
    HANOI(n-1, appoggio, destinazione, sorgente)
endif
#+end_example
#+begin_example
DIV-REC(a,b)
- Pre: a >= 0, b > 0
- Post: q,r t.c. a == bq + r && 0 <= r < b
if a < b then
    q,r <- 0,a
else
    q',r <- DIV-REC(a-b,b)
    q <- q'+1
end if
return q,r
#+end_example
**** Schema dell'induzione semplice
1. Caso base P(1)
2. Passo induttivo P(m+1), P(m) é l'ipotesi induttiva
3. 1. e 2. implicano che $\forall n \ge 1, P(n)$
**** Schema dell'induzione completa
1. Caso base
2. Passo induttivo
3. Conclusione
*** Iterazione
*Divisione Interativa*:
#+begin_example
DIV_IT(a,b)
while r >= b do
    r <- r-b
    q <- q+1
end while
return r,q
#+end_example

Si utilizzano le _invarianti_ per la dimostrazione di correttezza
- sempre vera:
  + inizializzazione
  + mantenimento
    - vale prima del ciclo =->= vale anche dopo il corpo del ciclo
Va scelto in modo che sia utile per la dimostrazione di correttezza

** Terminazione
T2 temporal prover
- la non terminazione puó essere semplicemente causata da un errore logico
- non terminazione implicita nel problema
  + problema $3n+1$
    - _Congettura di Collatz_
É difficile dimostrare la terminazione se i parametri non decrescono in tutti i casi
Spesso gli algoritmi diminuiscono la dimensione dei parametri, l'ampiezza dell'intervallo

** Problema del Ordinamento - Sorting
*** Binary Search
aka =Ricerca Dicotomica=
- _dimezza la dimensione del problema_ ad ogni passo

#+begin_example
BinSearch-Ric(x,A,i,j)
- Pre: A[i...j] ordinato
- Post: true se x appartiene A[i...j]
if i>j then
    return false
else
    m <- floor((i+j)/2)
    if x == A[m] then
        return true
    else
        if x<A[m] then
            return BinSearch-Ric(x,A,i,m-1)
        else
            return BinSearch-Ric(x,A,m+1,j)
        end if
    end if
end if
#+end_example
Casi
- best: $1$
- worst: $log_2 n$
*** Insertion Sort
per ordinare =A[1...n]=:
- la parte =A[1...i-1]= giá ordinato
- si puó inserire l'elemento =A[i]= nella parte ordinata tramite scambi
  - se =A[i] > A[i-1] -> A[1...i]= é ordinato e ci si ferma; altrimenti si scambia =A[i]= con =A[i-1]=
  - se =A[i-1] > A[i-2] -> A[1...i]= é ordinato; altrimenti si scambia =A[i-1]= e =A[i-2]=
  - ...
Si parte inserendo =A[2]= poi si prosegue fino a =n=
#+begin_example
Insertion-Sort(A)
for i<-2 to length(A) do
    j<-i
    while j>1 and A[j-1]>A[j] do
        scambia A[j-1] con A[j]
        j<-j-1
    end while
end for
return A
#+end_example
**** Terminazione
assicurata dalla limitatezza dei cicli *for* e *while*
**** Correttezza
2 cicli =->= 2 invarianti
1. =A[1...i-1]= é ordinato
   - corretto se il ciclo interno é corretto
2. =A[1...j-1]= e =A[j...i]= sono ordinati  =&&= =A[1...j-1] \le A[j+1...i]=
All'uscita dell'algoritmo abbiamo =i= uguale a =n+1= che implica che tutto il vettore =A[1...n]= é ordinato
**** Complessitá
dipende da =n= e dalla distribuzione all'interno del vettore
assegnamo un costo ad ogni riga dell'algoritmo e lo moltiplichiamo alle volte per cui é eseguito
1. for     - =n=
2. =<-=      - =n-1=
3. while   - $\sum_{i}^{n}{t_i-1}$
   a. 1 nel caso migliore
   b. i nel caso peggiore
4. scambio - $\sum_{i}^{n}{t_i-1}$

*Worst*:
$an^2 + bn + c$
Nel caso peggiore Insert-Sort ha _complessitá temporale quadratica_
*Best*:
$dn + e$
Nel caso migliore Insert-Sort ha _complessitá temporale lineare_
*** Selection Sort
Assumiamo che la parte sx del vettore sia giá ordinata e che contenga elementi \ge di questa parte a dx
- cerchiamo l'elemento minimo della parte dx e lo spostiamo in ultima posizione a sx (diminuendo la dimensione del problema)
#+begin_example
Selection-Sort(A)
for i <- 1 to length(A)-1 do
    j <- i+1
    k <- i
    while j < length(A)+1 do
        if A[j] < A[k] do
            k <- j
        end if
        j <- j+1
    end while
    scambia A[i] e A[k]
end for
return A
#+end_example
**** Terminazione
Implicata dalla terminazione dei cicli
**** Correttezza
2 Invarianti
1. =A[1...i-1]= ordinato e =A[i...n]= \ge =A[1...i-1]=
2. =A[k]= \le =A[i...j-1]=

**** Complessitá
Sia nel caso migliore che nel caso peggiore,
Complessitá temporale quadratica

