content/posts/20210414192358-problems_algorithms.md


#### Alberi di Decisione {#alberi-di-decisione}

le foglie dell'albero devono essere tutte le possibili pormutazioni degli elementi del vettore

-   \\(n!\\)
-   per costruire un albero con un numero tale di foglie sono necessari almeno \\(\log\_2 n!\\) livelli
-   Usando la formula di Stirling per approssimare \\(n!\\)
    -   \\(n \log\_2 n\\)

Che cresce molto piú lentamente di una funzione quadratica

-   ció implica che esistano algoritmi molto piú efficienti di quelli quadratici visti


### Complessitá di un algoritmo {#complessitá-di-un-algoritmo}

Risorse utilizzate dall'algoritmo

-   tempo
-   spazio
-   hardware
    -   sempre piú importante con piú core e thread di esecuzione

Noi trattiamo la **complessitá temporale**

-   per stimare la grandezza massima dell'ingresso(input) di un esecuzione ragionevole
-   per confrontare l'efficienza di piú algoritmi
-   _analisi asintotica_

<span class="underline">Il tempo di calcolo</span> é una funzione rispetto all'input
Gli approcci differiscono solo di una costante moltiplicativa (che puó essere quindi ignorata ai fini dell'analisi) sotto certe condizioni:

-   secondi di esecuzioni
-   numero di operazioni elementari
-   numero di volte una specifica operazione viene eseguita
    -   piú semplice

Una volta stabiliti i numeri di esecuzioni si passa all'analisi del caso migliore e del caso peggiore, si riconducono a polinomi

La **dimensione dell'ingresso** é una misura della sua rappresentazione

-   \\(\mid m \mid \log\_2 (m)+1\\)
-   \\(\mid A[0...n-1] \mid nc\\)
    -   \\(c\\) numero bit del generico elemento di \\(A\\)
        -   \\(c = 1\\) perché le <span class="underline">costanti moltiplicative</span> non contano dal punto di vista dell'analisi asintotica

Fissato la dimensione esistano algoritmi per cui \\(T\\) puó cambiare rispetto alla forma dell'input
Distinguiamo i casi: migliore e peggiore

-   \\(T\_{peggiore}(n) \text{max}\\{T()x\\}: \mid x\mid n\\)
-   \\(T\_{migliore}(n) \text{min}\\{T()x\\}: \mid x \mid n\\)

Dobbiamo confrontare tra loro funzioni che hanno infiniti valori

-   si trascura il numero finito di casi, conviene scegliere la funzione che cresce piú lentamente all'infinito
    -   se non ci interessano questi casi, se abbiamo informazioni in piú allora vanno analizzati anche questi casi

Quanto contano le costanti?

-   con un computer molto piú veloce la dimensione massima trattabile cambia in maniera trascurabile
-   la funzione che cresce meno velocemente é comunque piú importante di una costante moltiplicativa per il calcolo della complessitá
-   inoltre la stima delle costanti é molto difficile nella pratica


#### O-grande {#o-grande}

Definito da P. Bachman, 1892.
\\(f(n) \in O(g(n)) \iff \exists c > 0, n\_0 \forall n > n\_0 \mid f(n) \le cg(n)\\)
Un \\(f(n)\\) é O-grande di \\(g(n)\\) se e solo se \\(f(n)\\) cresce al piú come \\(g(n)\\) dopo un numero finito di casi \\(n\_0\\) e eventuali costanti moltiplicative \\(c\\).
Permette di specificare limiti superiori non stretti.

-   \\(O(1)\\)
    -   insieme delle funzioni superiormente limitate
        -   la dimensione dell'input non ha impatto sul lavoro dell'algoritmo

Se \\(p(n)\\) é un polinomio di grado \\(k\\) allora \\(p(k) \in O(n^k)\\)

**Definizione equivalente**
\\(f(n) \in O(g(n)) \iff lim\_{n \to \infty}\frac{f(n)}{g(n)}\\) e
\\(0 \le lim\_{n \to \infty} \frac{f(n)}{g(n)} < \infty\\)

**Teorema Utile**
\\(\lim\_{ n \to \infty}\frac{f(n)}{g(n)} = 0 \iff f(n) \in O(g(n)) \land g(n) \notin O(f(n))\\)

-   **NB**
    -   nei polinomi ció che conta é il termine di grado piú alto: il grado del polinomio
    -   nei logaritmi non conta la base per O-grande
        -   \\(O(\log\_a n) = O(\log\_b n) \text{ con } a,b >1\\)

-   **Inclusioni**
    -   \\(O(1) \subset O(\log n)\\)

    -   \\(O(\log n) \subset O(n)\\)

    -   \\(O(n) \subset O(n \log n)\\)

    -   \\(O(n^p) \subset O(2^n)\\)

    -   \\(O(2^n) \subset O(3^n)\\)

Il tempo di calcolo sufficiente alla risoluzione del problema é il suo confine superiore

-   confine superiore alla complessitá di un problema

Il tempo di calcolo necessario alla risoluzione del problema

-   confine inferiore alla complessitá del problema, per i tempi di calcolo di tutti gli algoritmi che risolvono il problema
-   banali
    -   dimensione del input
    -   dimensione del output
    -   eventi contabili


#### Omega {#omega}

\\(\Omega\\) limite asintotico inferiore
\\(f(n) \in \Omega(g(n)) \iff \exists c > 0, n\_0 \forall n > n\_0 \mid cg(n) \le f(n)\\)
\\(0< lim\_{n \to \infty} \frac{f(n)}{g(n)} \le \infty\\)


#### Teta {#teta}

&Theta; limite asintotico sia inferiore sia superiore
\\(f(n) \in \Theta(g(n)) \iff \exists c\_1 > 0,c\_2 >0, n\_0 \forall n > n\_0 \mid c\_1 g(n) \le f(n) \le c\_2 g(n)\\)
\\(f(n) \in \Theta(g(n)) \iff f(n) \in O(g(n)) \land f(n) \in \Omega (g(n))\\)
\\(0< lim\_{n \to \infty} \frac{f(n)}{g(n)} < \infty\\)


#### o-piccolo {#o-piccolo}

\\(f(n) \in (g(n)) \iff \forall c > 0 \exists n\_0 \forall n > n\_0 \mid f(n) \le cg(n)\\)
\\(f(n)\\) é un infinitesimo di \\(g(n)\\)


#### Somma-17 {#somma-17}

```text
Somma-17(V)
- Pre: V é un vettore che contiene numeri positivi
- Post: True se ci sono due numeri a,b t.c. a+b=17, False altrimenti

boolean b = False
for i=0 to length(V)-1
  for j=i+1 to length(V)-1
    if V[i] + V[j] == 17
      b = True
    end-if
  end-for
end-for
return b
```

\\(O(n^2)\\) per il numero di volte che viene eseguito l'if nel caso peggiore
\\(\Omega(n)\\) per la dimensione dei dati

<span class="underline">Soluzione di complessitá lineare</span>

```text
Somma-17-Lineare(V)

bool C[18]
int i, j
for i=0 to 17
  C[i] = False
end-for
for i=0 to length(V)-1
  if V[i] <= 17
    C[V[i]] = True
end-for
for i=0,j=17; i<j && !(C[i] && C[j]) do
  i++
  j--
end-for
return i < j
```

\\(T\_{Somma-17-Lineare}(n) \in O(18+n+9+1) \in O(n)\\)
Questo implica che l'algoritmo <span class="underline">é ottimo</span> in quanto \\(\Omega(n)\\) é confine inferiore del problema.


#### Minimo {#minimo}

\\(cn + d \le T(n) \le an+b\\)

-   contenuto tra funzioni lineari
    -   al piú lineare


### Relazioni di Ricorrenza {#relazioni-di-ricorrenza}

La funzione tempo di un algoritmo ricorsivo é a sua volta ricorsiva: é detta **Relazione di ricorrenza**

-   Calcolo ricorsivo del fattoriale

\\(T(n) = c \text{ se } n=0\\)
\\(T(n) = T(n-1)+d \text{ altrimenti}\\)

```C
int min_ric(int a[], int i){
  if (i = length(a))
      return a[i];
  else
      return min(a[i], min_ric(a, i+1));
}
```

Nel caso dell'algoritmo della torre di Hanoi ci si riconduce ad una sommatoria di progressione geometrica.
\\(T(n)=c^n b + \frac{c^n - 1}{c - 1}d\\)
\\(T(n) \subset \Theta(c^n)\\)


#### Quick Sort {#quick-sort}

Sceglie un perno e riorganizza il vettore per avere elementi minori di \\(q\\) prima di questo e maggiori dopo.
Ogni passo se necessario va partizionato il vettore.

```C
int partition(int a[],int s, int n){
  int i=s;
  int j = n-1;
  while(i<=j){
    if(a[i] <= a[0])
      i++;
    else if(a[j] > a[1])
      j--;
    else {
      int temp = a[i];
      a[i] = a[j];
      a[j] = temp;
    }
  }
  int temp = a[j];
  a[j] = a[s];
  a[s] = temp;
  return j;
}

void quick_sort(int a[]){
  int n = length(a)-1;
  if(n>0){
    int p = partition(a,0,n);
    if(p>2)
      quick_sort(a,0,n);
    if(p<n-1)
      quick_sort(a,p+1,n);
  }
}
```

Per dimostrarne la correttezza va utilizzata l'induzione completa, non semplice.

-   in quanto la dimensione delle due chiamate ricorsive operano su dimensioni ignote minori di n elementi

Uno volta dimostrata la correttezza di `partizione` la dimostrazione é banale

<!--list-separator-->

-  Complessitá

    Il partizionamento esamina una volta ogni elemento: é lineare
    \\(T\_p(n)=an\\)
    Identifichiamo le situazioni estreme della ricorsione di quicksort

    1.  due partizioni con lo stesso numero degli elementi
    2.  una contiene tutti gli elementi e una é vuota

    3.  da luogo ad una relazione di  ricorrenza
        -   \\(T(n) = c\\) con \\(n=1\\)

        -   \\(T(n)= T(n-1)+T\_p(n)+b\\) altriment
