roam/20210414192358-problems_algorithms.org
*** Relazioni Lineari a Partizione costante
Teorema master per relazioni lineari in termini $O()$, con $a$ che rappresenta il numero di chiamate ricorsive.
h: quanto diminuisce la dimensione del problema
a: numero delle chiamate ricorsive
b e c: quanto tempo impiegano le parti non ricorsive
- $a=1$: $T(n)\subset O(n^{b+1})$
- $a\ge 2$: $T(n)\subset O(a^n n^b)$

Il risultato dá meno informazioni rispetto alla sostituzione o l'iterazione, che dá informazioni rispetto a $\Theta()$.
Puó anche non fornire il limite piú stretto possibile.
** Divide et Impera - Relazioni lineari a partizione bilanciata
~Teorema~
$T(n) = d \text{ se }n=1$
$T(n) = aT(n/b)+cn^\beta \text{ se } n=1$
allora:
posto $\alpha = \log a / \log b$
$\alpha > \beta$: $T(n) \subset O(n^\alpha)$
$\alpha = \beta$: $T(n) \subset O(n^\alpha \log n)$
$\alpha < \beta$: $T(n) \subset O(n^\beta)$
*** Minimo e Massimo
*** Merge Sort
Fondere array ordinati impiega molto meno tempo
#+begin_src C
int merge(int b[],int c[]){
  if (b == NULL)
    return c;
  else if(c == NULL)
    return b;
  else if(b[1] <= c[1])
    return {b[1],merge(b[2...length(b)],c)};
  else
    return {c[1],merge(b,c[2...length(b)])};
}

int merge_sort(int a[], int i, int n){
  if(n-i == 1)
    return a;
  else{
    int k = (n-i)/2;
    int b[] = merge_sort(a, 1, k);
    int c[] = merge_sort(a, k+1, n);
    return merge(b,c);
  }
}
#+end_src

**** Complessitá
$T(n)=2T(n/2)+n$
$T(n)=\log_2 n \cdot n \text{ . } cn \in \Theta(n \log n)$
L'algoritmo é ottimo.

*** Quick Sort: caso medio
Il caso peggiore é noto (quadratico), il caso migliore sará come il =Merge Sort= $O(n \log n)$

Si dimostra che é ottimo con $O(n \log n)$
** Programmazione Dinamica
Si basano come i /Divide et Impera/ sulla scomposizione ricorsiva di un problema in sottoproblemi per poi ricomporli
- *DI* efficiente se i sottopreblemi sono indipendenti, altrimenti puó fare lo stesso lavoro piú di una volta
- *DI* puó essere molto inefficiente se i sottoproblemi non sono indipendenti tra loro
Al contrario *PD* puó semplificare molto il problema.

Il problema deve possedere due proprietá
1. /sottostruttura della soluzione/
   - la soluzione del sottoproblema e' un sottoinsieme del problema
2. /sottoproblemi ripetuti/
   - una soluzione deve essere riutilizzabile in un altro sottoproblema
   - annotazione dei risultati piu' semplici
     - [[file:20210402203855-memoization.org][Memoization]]
   - per efficienza di memoria si sviluppa un approccio [[file:20210402203940-bottom_up.org][Bottom-up]]

Prima si sviluppa una soluzione iterativa, poi la si migliora con le tecniche della *PD*
*** Successione di Fibonacci
$f_0 = 0 \text{, } f_1=1$
$f_n = f_{n-2} + f_{n-1}  \text{ per } n>1$
#+begin_example
Fib(n)
if n <= 2 then
  f = 1
else
  f = Fib(n-1) + Fib(n-2)
endif
return f
#+end_example
La /relazione di ricorrenza/ del numero di nodi $N_n$ nell'albero delle chiamate é simile a quella della sequenza di Fibonacci $f_n$. Cambia per un +1.
La _formula di Binet_ permette il calcolo del ennesimo Fibonacci.
$N_n \subset \Omega(\phi^n)$
Quindi ha crescita esponenziale, almeno.

Molto lento  perché é richiesto il _calcolo della stessa cosa ripetutamente_
- perció implementiamo la /memoization/: approccio [[file:20210402210717-top_down.org][Top-down]]
  - lo spazio utilizzato per migliorare l'algoritmo cosí é $\Theta(n)$
L'albero ha uno sviluppa lineare verso sinistra, anche il tempo sará $\Theta(n)$

#+begin_example
Fib-BottomUp(n)
if n <= 2 then
  return 1
else
  Fib[1] = 1, Fib[2] = 1
  for i=3 to n do
    Fib[i] = Fib[i-1]+Fib[i-2]
  end-for
endif
return Fib[n]
#+end_example
Tempo e spazio sono $\Theta(n)$

L'array puó essere eliminato, servono solo gli ultimi due numeri
#+begin_example
Fib-Iter(n)
if n <= 2 then
  return 1
else
  FibA = 1, FibB = 1
  for i=3 to n do
    tmp = FibA+FibB
    FibB = FibA
    FibA = tmp
  end-for
endif
return FibA
#+end_example
Il tempo di calcolo é sempre $\Theta(n)$
ma lo spazio  ora é $\Theta(1)$
*** Massima Sottosequenza Comune - LCS
=Longest Common Subsequence=
es: Trattando Stringhe di DNA
Non si intendono elementi necessariamente successivi
- CS = sotto-sequenza / common-subsequence
Z é LCS se
- =Z cs X && Z cs Y && Z ha lunghezza massima=

*Proprietá della sottostruttura*
- mettere in relazione $LCS(X,Y)$ con la soluzioni che coinvolgono prefissi di $X$ e $Y$
- definiamo $k,m,n$ come lunghezze di $Z,X.Y$
- due casi
  + $x_m = y_n$
    - se $Z$ é $LCS(X,Y)$ allora $z_k$ sará $x_m$
      + allora $Z_{k-1}$ é $LCS(X_{m-1},Y_{n-1})$
  + $x_m \neq y_n$
    - se $Z$ é $LCS(X,Y)$ allora $z_k$ puó essere $x_m$ o $y_n$ o qualsiasi altro
      + sicuramente $x_m$ o $y_n$ non serve per formare $Z$, anche entrambi
      + allora $Z_{k-1}$ é $LCS(X_{m-1},Y_{n})$ o $LCS(X_{m},Y_{n-1})$ o entrambi
=Teorema=
- se $i=0 || j=0$
  + < >
- se $x_i = y_j$
  + $LCS(X_{i-1}, Y_{j-1}) + x_i$ dove $+$ indica la concatenazione
- se $x_i \neq y_j$
  - longest($LCS(X_{i-1},Y)$, $LCS(X,Y_{j-1})$)

Il Tempo di calcolo di questa procedura ricorsiva é esponenziale:
$T(k)=2T(k-1)+1 \in \Theta(2^k) =  \Theta(2^{m+n})$

Si costruiscono due tabelle basate sullo schema ricorsivo
$c[0..m, 0..n]$ e $b[1..m, 1..n]$

**** Algoritmo Bottom-up
permette di ottimizzare riempiendo una tabella $m \cdot n$
$T(k) \in \Theta(m \cdot n)$
