content/posts/20210414192358-problems_algorithms.md


#### Relazioni Lineari a Partizione costante {#relazioni-lineari-a-partizione-costante}

Teorema master per relazioni lineari in termini \\(O()\\), con \\(a\\) che rappresenta il numero di chiamate ricorsive.
h: quanto diminuisce la dimensione del problema
a: numero delle chiamate ricorsive
b e c: quanto tempo impiegano le parti non ricorsive

-   \\(a=1\\): \\(T(n)\subset O(n^{b+1})\\)
-   \\(a\ge 2\\): \\(T(n)\subset O(a^n n^b)\\)

Il risultato dá meno informazioni rispetto alla sostituzione o l'iterazione, che dá informazioni rispetto a \\(\Theta()\\).
Puó anche non fornire il limite piú stretto possibile.


### Divide et Impera - Relazioni lineari a partizione bilanciata {#divide-et-impera-relazioni-lineari-a-partizione-bilanciata}

`Teorema`
\\(T(n) = d \text{ se }n=1\\)
\\(T(n) = aT(n/b)+cn^\beta \text{ se } n=1\\)
allora:
posto \\(\alpha = \log a / \log b\\)
\\(\alpha > \beta\\): \\(T(n) \subset O(n^\alpha)\\)
\\(\alpha = \beta\\): \\(T(n) \subset O(n^\alpha \log n)\\)
\\(\alpha < \beta\\): \\(T(n) \subset O(n^\beta)\\)


#### Minimo e Massimo {#minimo-e-massimo}


#### Merge Sort {#merge-sort}

Fondere array ordinati impiega molto meno tempo

```C
int merge(int b[],int c[]){
  if (b == NULL)
    return c;
  else if(c == NULL)
    return b;
  else if(b[1] <= c[1])
    return {b[1],merge(b[2...length(b)],c)};
  else
    return {c[1],merge(b,c[2...length(b)])};
}

int merge_sort(int a[], int i, int n){
  if(n-i == 1)
    return a;
  else{
    int k = (n-i)/2;
    int b[] = merge_sort(a, 1, k);
    int c[] = merge_sort(a, k+1, n);
    return merge(b,c);
  }
}
```

<!--list-separator-->

-  Complessitá

    \\(T(n)=2T(n/2)+n\\)
    \\(T(n)=\log\_2 n \cdot n \text{ . } cn \in \Theta(n \log n)\\)
    L'algoritmo é ottimo.


#### Quick Sort: caso medio {#quick-sort-caso-medio}

Il caso peggiore é noto (quadratico), il caso migliore sará come il `Merge Sort` \\(O(n \log n)\\)

Si dimostra che é ottimo con \\(O(n \log n)\\)


### Programmazione Dinamica {#programmazione-dinamica}

Si basano come i _Divide et Impera_ sulla scomposizione ricorsiva di un problema in sottoproblemi per poi ricomporli

-   **DI** efficiente se i sottopreblemi sono indipendenti, altrimenti puó fare lo stesso lavoro piú di una volta
-   **DI** puó essere molto inefficiente se i sottoproblemi non sono indipendenti tra loro

Al contrario **PD** puó semplificare molto il problema.

Il problema deve possedere due proprietá

1.  _sottostruttura della soluzione_
    -   la soluzione del sottoproblema e' un sottoinsieme del problema
2.  _sottoproblemi ripetuti_
    -   una soluzione deve essere riutilizzabile in un altro sottoproblema
    -   annotazione dei risultati piu' semplici
        -   [Memoization]({{< relref "20210402203855-memoization.md" >}})
    -   per efficienza di memoria si sviluppa un approccio [Bottom-up]({{< relref "20210402203940-bottom_up.md" >}})

Prima si sviluppa una soluzione iterativa, poi la si migliora con le tecniche della **PD**


#### Successione di Fibonacci {#successione-di-fibonacci}

\\(f\_0 = 0 \text{, } f\_1=1\\)
\\(f\_n = f\_{n-2} + f\_{n-1}  \text{ per } n>1\\)

```text
Fib(n)
if n <= 2 then
  f = 1
else
  f = Fib(n-1) + Fib(n-2)
endif
return f
```

La _relazione di ricorrenza_ del numero di nodi \\(N\_n\\) nell'albero delle chiamate é simile a quella della sequenza di Fibonacci \\(f\_n\\). Cambia per un +1.
La <span class="underline">formula di Binet</span> permette il calcolo del ennesimo Fibonacci.
\\(N\_n \subset \Omega(\phi^n)\\)
Quindi ha crescita esponenziale, almeno.

Molto lento  perché é richiesto il <span class="underline">calcolo della stessa cosa ripetutamente</span>

-   perció implementiamo la _memoization_: approccio [Top-down]({{< relref "20210402210717-top_down.md" >}})
    -   lo spazio utilizzato per migliorare l'algoritmo cosí é \\(\Theta(n)\\)

L'albero ha uno sviluppa lineare verso sinistra, anche il tempo sará \\(\Theta(n)\\)

```text
Fib-BottomUp(n)
if n <= 2 then
  return 1
else
  Fib[1] = 1, Fib[2] = 1
  for i=3 to n do
    Fib[i] = Fib[i-1]+Fib[i-2]
  end-for
endif
return Fib[n]
```

Tempo e spazio sono \\(\Theta(n)\\)

L'array puó essere eliminato, servono solo gli ultimi due numeri

```text
Fib-Iter(n)
if n <= 2 then
  return 1
else
  FibA = 1, FibB = 1
  for i=3 to n do
    tmp = FibA+FibB
    FibB = FibA
    FibA = tmp
  end-for
endif
return FibA
```

Il tempo di calcolo é sempre \\(\Theta(n)\\)
ma lo spazio  ora é \\(\Theta(1)\\)


#### Massima Sottosequenza Comune - LCS {#massima-sottosequenza-comune-lcs}

`Longest Common Subsequence`
es: Trattando Stringhe di DNA
Non si intendono elementi necessariamente successivi

-   CS = sotto-sequenza / common-subsequence

Z é LCS se

-   `Z cs X && Z cs Y && Z ha lunghezza massima`

**Proprietá della sottostruttura**

-   mettere in relazione \\(LCS(X,Y)\\) con la soluzioni che coinvolgono prefissi di \\(X\\) e \\(Y\\)
-   definiamo \\(k,m,n\\) come lunghezze di \\(Z,X.Y\\)
-   due casi
    -   \\(x\_m = y\_n\\)
        -   se \\(Z\\) é \\(LCS(X,Y)\\) allora \\(z\_k\\) sará \\(x\_m\\)
            -   allora \\(Z\_{k-1}\\) é \\(LCS(X\_{m-1},Y\_{n-1})\\)
    -   \\(x\_m \neq y\_n\\)
        -   se \\(Z\\) é \\(LCS(X,Y)\\) allora \\(z\_k\\) puó essere \\(x\_m\\) o \\(y\_n\\) o qualsiasi altro
            -   sicuramente \\(x\_m\\) o \\(y\_n\\) non serve per formare \\(Z\\), anche entrambi
            -   allora \\(Z\_{k-1}\\) é \\(LCS(X\_{m-1},Y\_{n})\\) o \\(LCS(X\_{m},Y\_{n-1})\\) o entrambi

`Teorema`

-   se \\(i=0 || j=0\\)
    -   &lt; &gt;
-   se \\(x\_i = y\_j\\)
    -   \\(LCS(X\_{i-1}, Y\_{j-1}) + x\_i\\) dove \\(+\\) indica la concatenazione
-   se \\(x\_i \neq y\_j\\)
    -   longest(\\(LCS(X\_{i-1},Y)\\), \\(LCS(X,Y\_{j-1})\\))

Il Tempo di calcolo di questa procedura ricorsiva é esponenziale:
\\(T(k)=2T(k-1)+1 \in \Theta(2^k) =  \Theta(2^{m+n})\\)

Si costruiscono due tabelle basate sullo schema ricorsivo
\\(c[0..m, 0..n]\\) e \\(b[1..m, 1..n]\\)

<!--list-separator-->

-  Algoritmo Bottom-up

    permette di ottimizzare riempiendo una tabella \\(m \cdot n\\)
    \\(T(k) \in \Theta(m \cdot n)\\)
